# Data-Science-Libraries-Assignment-2

# Section 1:

## Task 1: setup and DataFrame Creation

In [1]:
# Install Pandas
! pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\sarug\appdata\roaming\python\python312\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sarug\appdata\roaming\python\python312\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sarug\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\sarug\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sarug\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\sarug\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 24.0 -> 24.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
# Import Pandas 
import pandas as pd

In [6]:
# Create a DataFrame from a dictionary
dict_1 ={
    'Name' : ['Suman', 'Reetu', 'Melina', 'Janak'],
    'Age' : ['23', '24', '29', '22']
}
dict_1

{'Name': ['Suman', 'Reetu', 'Melina', 'Janak'],
 'Age': ['23', '24', '29', '22']}

In [7]:
df = pd.DataFrame(dict_1)
df

     Name Age
0   Suman  23
1   Reetu  24
2  Melina  29
3   Janak  22

In [8]:
# Create dataframes from a list of dictionaries
data = [{'Name': 'Manoj', 'Age':'24'}, {'Name': 'Shrejal', 'Age':'10'}, {'Name': 'Prabin', 'Age':'20'}]
data

[{'Name': 'Manoj', 'Age': '24'},
 {'Name': 'Shrejal', 'Age': '10'},
 {'Name': 'Prabin', 'Age': '20'}]

In [9]:
df = pd.DataFrame(data)
df

      Name Age
0    Manoj  24
1  Shrejal  10
2   Prabin  20

In [11]:
# Creating dataframes from file and load a dataset from a CSV file
data2 = pd.read_csv(r"D:\AI Building Capacity\Week3\Session3\messed_dataset.csv")
data2

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19
...,...,...,...,...,...,...
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

## Task 2: Viewing and Inspecting Data

In [12]:
# Display the first rows of the DataFrame
print(data2.head())

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19

In [13]:
data2.head()

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19

In [14]:
data2.head(8)

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19
5,Jonathan Holland,26.0,mayercaitlin@example.org,Cameroon,25660.99,2023-05-01
6,James Clark,80.0,ynguyen@example.net,NaN,61345.33,NaN
7,Kimberly Roberts,76.0,lmiller@example.org,Netherlands,58550.56,2023-07-08

In [15]:
# Display the last few rows of the Datframe
data2.tail()

,Name,Age,Email,Country,Salary,DateOfJoining
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

In [16]:
data2.tail(10)

,Name,Age,Email,Country,Salary,DateOfJoining
90,invalid,43.0,NaN,Indonesia,41928.2,2020-05-08
91,Ryan Middleton,42.0,mcconnellashley@example.net,Bahamas,78048.75,2021-04-05
92,Seth Bradley,76.0,melissakim@example.org,Slovakia (Slovak Republic),49354.13,2021-08-01
93,Alicia Miller,59.0,thomas45@example.net,Mauritania,52834.29,2020-06-03
94,Cody Jackson,48.0,jamieayers@example.net,Luxembourg,55583.62,2021-05-23
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

In [17]:
# Get a Summary of the DataFrame, including basic statics and data types.
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           89 non-null     object
 1   Age            97 non-null     object
 2   Email          80 non-null     object
 3   Country        86 non-null     object
 4   Salary         94 non-null     object
 5   DateOfJoining  79 non-null     object
dtypes: object(6)
memory usage: 4.8+ KB

In [18]:
data2.describe()

           Name   Age                Email Country   Salary DateOfJoining
count        89    97                   80      86       94            79
unique       85    53                   80      76       93            79
top     invalid  76.0  ycastro@example.org  Greece  invalid    2022-09-29
freq          5     6                    1       2        2             1

In [22]:
# Display the shape of Dataframe
data2.shape

(100, 6)

In [23]:
# Display the column names of the DataFrame
data2.columns.tolist()

['Name', 'Age', 'Email', 'Country', 'Salary', 'DateOfJoining']

## Task 3: Selection and Indexing

In [24]:
# Selecting a single column
data2['Name']

0                invalid
1        David Jefferson
2          Jessica Reyes
3      Kenneth Macdonald
4            Julie Horne
             ...
95      Garrett Davidson
96        Elizabeth Ross
97                   NaN
98        Patricia Singh
99    Christopher Stokes
Name: Name, Length: 100, dtype: object

In [25]:
# Selecting multiple Columns
data2[['Name', 'Email', 'Country']]

                  Name                     Email            Country
0              invalid       ycastro@example.org        Switzerland
1      David Jefferson                       NaN              China
2        Jessica Reyes                       NaN                NaN
3    Kenneth Macdonald         ewolf@example.com              Italy
4          Julie Horne                       NaN            Ecuador
..                 ...                       ...                ...
95    Garrett Davidson        gjames@example.com    Solomon Islands
96      Elizabeth Ross  richardlewis@example.net  Equatorial Guinea
97                 NaN       brian50@example.com            Somalia
98      Patricia Singh      lramirez@example.org             Greece
99  Christopher Stokes                       NaN       South Africa

[100 rows x 3 columns]

In [26]:
# Selecting a row by index
data2.iloc[12]

Name             Kelly Schultz
Age                       21.0
Email                      NaN
Country               Kiribati
Salary                93448.73
DateOfJoining       2023-07-24
Name: 12, dtype: object

In [27]:
# Selecting rows by index
data2.iloc[5:10]

,Name,Age,Email,Country,Salary,DateOfJoining
5,Jonathan Holland,26.0,mayercaitlin@example.org,Cameroon,25660.99,2023-05-01
6,James Clark,80.0,ynguyen@example.net,NaN,61345.33,NaN
7,Kimberly Roberts,76.0,lmiller@example.org,Netherlands,58550.56,2023-07-08
8,Barbara Armstrong,22.0,fmitchell@example.com,NaN,NaN,NaN
9,Jason Perez,59.0,collinsedward@example.com,Myanmar,20175.11,2024-04-11

In [28]:
# Selecting a row by labels
data2.loc[2] # Selects the 3rd row

Name             Jessica Reyes
Age                       34.0
Email                      NaN
Country                    NaN
Salary                60511.62
DateOfJoining       2022-05-24
Name: 2, dtype: object

In [29]:
# Selecting rows by labels
data2.loc[5:10]

,Name,Age,Email,Country,Salary,DateOfJoining
5,Jonathan Holland,26.0,mayercaitlin@example.org,Cameroon,25660.99,2023-05-01
6,James Clark,80.0,ynguyen@example.net,NaN,61345.33,NaN
7,Kimberly Roberts,76.0,lmiller@example.org,Netherlands,58550.56,2023-07-08
8,Barbara Armstrong,22.0,fmitchell@example.com,NaN,NaN,NaN
9,Jason Perez,59.0,collinsedward@example.com,Myanmar,20175.11,2024-04-11
10,Olivia Strong,76.0,schultzpatricia@example.com,South Africa,72362.02,2023-07-27

In [33]:
# Selecting Specific rows and columns using iloc
data2.iloc[0:5, [0, 2]]

                Name                Email
0            invalid  ycastro@example.org
1    David Jefferson                  NaN
2      Jessica Reyes                  NaN
3  Kenneth Macdonald    ewolf@example.com
4        Julie Horne                  NaN

In [34]:
# Selecing Specific rows and columns using loc
data2.loc[0:5,['Name', 'Email']]

                Name                     Email
0            invalid       ycastro@example.org
1    David Jefferson                       NaN
2      Jessica Reyes                       NaN
3  Kenneth Macdonald         ewolf@example.com
4        Julie Horne                       NaN
5   Jonathan Holland  mayercaitlin@example.org

## Task 4: Handing Missing data`

In [36]:
# Identify the missing values in the DataFrame
data2.isnull().sum()

Name             11
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64

In [37]:
# Drop rows with missing values.
data2.dropna(inplace = True)

In [39]:
data2.isnull().sum()

Name             0
Age              0
Email            0
Country          0
Salary           0
DateOfJoining    0
dtype: int64

In [124]:
# Create a DataFrame from a dictionary with some empty entries
entry ={
    'Name' : ['Suman', 'Reetu', 'Melina', 'Janak', 'Raju'],
    'Age' : ['23', '24', '29', '22','18']
}
entry

{'Name': ['Suman', 'Reetu', 'Melina', 'Janak', 'Raju'],
 'Age': ['23', '24', '29', '22', '18']}

In [125]:
df1 = pd.DataFrame(entry)
df1

     Name Age
0   Suman  23
1   Reetu  24
2  Melina  29
3   Janak  22
4    Raju  18

In [126]:
# Filling missing values with a specified value
df1.fillna(value = {'Age': 0}, inplace = True) # fill the entry with 0 if there is empty or missing values

## Task 5: Data Operations

In [127]:
# Add a new column to the Datframe.
df1['Address'] =['Pokhara','Rampur','Kathmandu','Palpa','Butwal']
df1

     Name Age    Address
0   Suman  23    Pokhara
1   Reetu  24     Rampur
2  Melina  29  Kathmandu
3   Janak  22      Palpa
4    Raju  18     Butwal

In [128]:
list_salary =[3000,5000,2500,9000,6000]
df1['Salary'] = list_salary
df1

     Name Age    Address  Salary
0   Suman  23    Pokhara    3000
1   Reetu  24     Rampur    5000
2  Melina  29  Kathmandu    2500
3   Janak  22      Palpa    9000
4    Raju  18     Butwal    6000

In [129]:
# Delete a colun fro the DataFrame.
df1.drop(columns = ['Age'], inplace = True)

In [130]:
df1

     Name    Address  Salary
0   Suman    Pokhara    3000
1   Reetu     Rampur    5000
2  Melina  Kathmandu    2500
3   Janak      Palpa    9000
4    Raju     Butwal    6000

In [131]:
# Rename columns in the DataFrame.
df1.rename(columns ={'Name':'First_Name'},inplace = True)

In [132]:
df1

  First_Name    Address  Salary
0      Suman    Pokhara    3000
1      Reetu     Rampur    5000
2     Melina  Kathmandu    2500
3      Janak      Palpa    9000
4       Raju     Butwal    6000

In [133]:
# Apply a function to a column
df1['Salary'] = df1['Salary'].apply(lambda x:x+500) 
df1

  First_Name    Address  Salary
0      Suman    Pokhara    3500
1      Reetu     Rampur    5500
2     Melina  Kathmandu    3000
3      Janak      Palpa    9500
4       Raju     Butwal    6500

## Task 6: GroupBy Operations

In [147]:
student = {
    'Name': ['Suman','Janak', 'Reetu', 'Melina', 'Janak', 'Raju','Melina'],
    'Roll': [1, 10, 2, 5, 10, 12, 5],
    'Marks': [70, 85, 65, 44, 56, 89, 67]
    }
std_df = pd.DataFrame(student)
std_df

     Name  Roll  Marks
0   Suman     1     70
1   Janak    10     85
2   Reetu     2     65
3  Melina     5     44
4   Janak    10     56
5    Raju    12     89
6  Melina     5     67

In [148]:
# Group by Name
grouped = std_df.groupby('Name')
grouped

In [150]:
# Calculate the mean
mean_marks = grouped['Marks'].mean()
mean_marks

Name
Janak     70.5
Melina    55.5
Raju      89.0
Reetu     65.0
Suman     70.0
Name: Marks, dtype: float64

In [151]:
SD_marks = grouped['Marks'].std()
SD_marks

Name
Janak     20.506097
Melina    16.263456
Raju            NaN
Reetu           NaN
Suman           NaN
Name: Marks, dtype: float64

In [152]:
# Iterating over groups and display the group names and data.
for name, group in grouped:
    print("Group Name: {name}")
    print(group,"\n")

Group Name: {name}
    Name  Roll  Marks
1  Janak    10     85
4  Janak    10     56

Group Name: {name}
     Name  Roll  Marks
3  Melina     5     44
6  Melina     5     67

Group Name: {name}
   Name  Roll  Marks
5  Raju    12     89

Group Name: {name}
    Name  Roll  Marks
2  Reetu     2     65

Group Name: {name}
    Name  Roll  Marks
0  Suman     1     70

## Task 7: Merging and Joining DataFrames

In [171]:
# Creating the First Dataframe with common column 'Id'
fdf= pd.DataFrame({'Id':[1, 2, 3],
                    'C': ['Pokhara', 'Kathmandu', 'Palpa'],
                    'D': [5000, 8000, 6000]},
                    index = ['1','2','3'])
fdf

   Id          C     D
1   1    Pokhara  5000
2   2  Kathmandu  8000
3   3      Palpa  6000

In [170]:
# Creagint the 2nd DataFrame with common column 'Id'
sdf= pd.DataFrame({'Id':[1, 2, 3],
                    'A': ['Suman', 'Melina', 'Janak'],
                    'B': [23, 29, 22]},
                    index = ['1','2','3'])
sdf

   Id       A   B
1   1   Suman  23
2   2  Melina  29
3   3   Janak  22

In [173]:
# Merge two DataFrames on a common Column
merged_df = pd.merge(sdf,fdf, on='Id')
merged_df

   Id       A   B          C     D
0   1   Suman  23    Pokhara  5000
1   2  Melina  29  Kathmandu  8000
2   3   Janak  22      Palpa  6000

In [176]:
# Creating the first DataFrame
new1= pd.DataFrame({'C': ['Pokhara', 'Kathmandu', 'Palpa'],
                    'D': [5000, 8000, 6000]},
                    index = ['1','2','3'])
new1

           C     D
1    Pokhara  5000
2  Kathmandu  8000
3      Palpa  6000

In [175]:
# Creating the 2nd DataFrame
new2= pd.DataFrame({'A': ['Suman', 'Melina', 'Janak'],
                    'B': [23, 29, 22]},
                    index = ['1','2','3'])
new2

        A   B
1   Suman  23
2  Melina  29
3   Janak  22

In [168]:
# Merging two DataFrames on a common column
joined_df = new2.join(new1)

In [174]:
joined_df

        A   B          C     D
1   Suman  23    Pokhara  5000
2  Melina  29  Kathmandu  8000
3   Janak  22      Palpa  6000

In [179]:
## Task 8: Working with Dates and Times
std

     Name  Roll  Marks
0   Suman     1     70
1   Janak    10     85
2   Reetu     2     65
3  Melina     5     44
4   Janak    10     56
5    Raju    12     89
6  Melina     5     67

In [183]:
# Creating a datetime ndex for a DataFrame
std_df['Date'] = pd.date_range(start = '7/5/2024', periods = len(std_df), freq = 'D')
std_df

     Name  Roll  Marks       Date
0   Suman     1     70 2024-07-05
1   Janak    10     85 2024-07-06
2   Reetu     2     65 2024-07-07
3  Melina     5     44 2024-07-08
4   Janak    10     56 2024-07-09
5    Raju    12     89 2024-07-10
6  Melina     5     67 2024-07-11

In [187]:
# Converting a column to datetme
std_df['Date'] = pd.to_datetime(std_df['Date'])
std_df

     Name  Roll  Marks       Date
0   Suman     1     70 2024-07-05
1   Janak    10     85 2024-07-06
2   Reetu     2     65 2024-07-07
3  Melina     5     44 2024-07-08
4   Janak    10     56 2024-07-09
5    Raju    12     89 2024-07-10
6  Melina     5     67 2024-07-11

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [188]:
# Extracting date components
std_df['Year'] = std_df['Date'].dt.year
std_df

     Name  Roll  Marks       Date  Year
0   Suman     1     70 2024-07-05  2024
1   Janak    10     85 2024-07-06  2024
2   Reetu     2     65 2024-07-07  2024
3  Melina     5     44 2024-07-08  2024
4   Janak    10     56 2024-07-09  2024
5    Raju    12     89 2024-07-10  2024
6  Melina     5     67 2024-07-11  2024

In [189]:
std_df['Month'] = std_df['Date'].dt.month
std_df['Day'] = std_df['Date'].dt.day
std_df

     Name  Roll  Marks       Date  Year  Month  Day
0   Suman     1     70 2024-07-05  2024      7    5
1   Janak    10     85 2024-07-06  2024      7    6
2   Reetu     2     65 2024-07-07  2024      7    7
3  Melina     5     44 2024-07-08  2024      7    8
4   Janak    10     56 2024-07-09  2024      7    9
5    Raju    12     89 2024-07-10  2024      7   10
6  Melina     5     67 2024-07-11  2024      7   11

## Task 9: Input and Output

In [197]:
# Read data from a CSV file into a DataFrame.
file = pd.read_csv(r"D:\AI Building Capacity\Week3\Session3\file_name.csv")
IO_df = pd.DataFrame(file)

In [198]:
IO_df

    Name  Age  Score        Date  Year  Month  Day
0   John   24     84  2024-01-01  2024      1    1
1    Ana   25     83  2024-01-02  2024      1    2
2   John   24     95  2024-01-03  2024      1    3
3    Ana   25     75  2024-01-04  2024      1    4
4  Peter   35     82  2024-01-05  2024      1    5

In [200]:
# Writing to a csv file
df.to_csv('fileName.csv', index = False)

In [204]:
xlsx_file = pd.read_excel(r"D:\AI Building Capacity\Week3\Session3\SaleData.xlsx")
xlsx_df = pd.DataFrame(xlsx_file)

In [205]:
xlsx_df

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.00,1198.000,113810.00
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.00,500.000,25000.00
2,2018-02-09,Central,Hermann,Luis,Television,36.00,1198.000,43128.00
3,2018-02-26,Central,Timothy,David,Cell Phone,27.00,225.000,6075.00
4,2018-03-15,West,Timothy,Stephen,Television,56.00,1198.000,67088.00
5,2018-04-01,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
6,2018-04-18,Central,Martha,Steven,Television,75.00,1198.000,89850.00
7,2018-05-05,Central,Hermann,Luis,Television,90.00,1198.000,107820.00
8,2018-05-22,West,Douglas,Michael,Television,32.00,1198.000,38336.00
9,2018-06-08,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
10,2018-06-25,Central,Hermann,Sigal,Television,90.00,1198.000,107820.00
11,2018-07-12,East,Martha,Diana,Home Theater,29.00,500.000,14500.00
12,2018-07-29,East,Douglas,Karen,Home Theater,81.00,500.000,40500.00
13,2018-08-15,East,Martha,Alexander,Television,35.00,1198.000,41930.00
14,2018-09-01,Central,Douglas,John,Desk,2.00,125.000,250.00
15,2018-09-18,East,Martha,Alexander,Video Games,16.00,58.500,936.00
16,2018-10-05,Central,Hermann,Sigal,Home Theater,28.00,500.000,14000.00
17,2018-10-22,East,Martha,Alexander,Cell Phone,64.00,225.000,14400.00
18,2018-11-08,East,Douglas,Karen,Cell Phone,15.00,225.000,3375.00
19,2018-11-25,Central,Hermann,Shelli,Video Games,96.00,58.500,5616.00
20,2018-12-12,Central,Douglas,John,Television,67.00,1198.000,80266.00
21,2018-12-29,East,Douglas,Karen,Video Games,74.00,58.500,4329.00
22,2019-01-15,Central,Timothy,David,Home Theater,46.00,500.000,23000.00
23,2019-02-01,Central,Douglas,John,Home Theater,87.00,500.000,43500.00
24,2019-02-18,East,Martha,Alexander,Home Theater,4.00,500.000,2000.00
25,2019-03-07,West,Timothy,Stephen,Home Theater,7.00,500.000,3500.00
26,2019-03-24,Central,Hermann,Luis,Video Games,50.00,58.500,2925.00
27,2019-04-10,Central,Martha,Steven,Television,66.00,1198.000,79068.00
28,2019-04-27,East,Martha,Diana,Cell Phone,96.00,225.000,21600.00
29,2019-05-14,Central,Timothy,David,Television,53.00,1198.000,63494.00
30,2019-05-31,Central,Timothy,David,Home Theater,80.00,500.000,40000.00
31,2019-06-17,Central,Hermann,Shelli,Desk,5.00,125.000,625.00
32,2019-07-04,East,Martha,Alexander,Video Games,62.00,58.500,3627.00
33,2019-07-21,Central,Hermann,Sigal,Video Games,55.00,58.500,3217.50
34,2019-08-07,Central,Hermann,Shelli,Video Games,42.00,58.500,2457.00
35,2019-08-24,West,Timothy,Stephen,Desk,3.00,125.000,375.00
36,2019-09-10,Central,Timothy,David,Television,7.00,1198.000,8386.00
37,2019-09-27,West,Timothy,Stephen,Cell Phone,76.00,225.000,17100.00
38,2019-10-14,West,Douglas,Michael,Home Theater,57.00,500.000,28500.00
39,2019-10-31,Central,Martha,Steven,Television,14.00,1198.000,16772.00
40,2019-11-17,Central,Hermann,Luis,Home Theater,11.00,500.000,5500.00
41,2019-12-04,Central,Hermann,Luis,Home Theater,94.00,500.000,47000.00
42,2019-12-21,Central,Martha,Steven,Home Theater,28.00,500.000,14000.00
43,NaT,NaN,NaN,NaN,NaN,278.00,1125.000,62550.00
44,NaT,NaN,NaN,NaN,NaN,34.75,140.625,7818.75

In [207]:
xlsx_df.to_excel('Sale_Data.xlsx', index = False)